### Terraform :robot: Plan :memo: 
Status: `success` :white_check_mark:

Details:
<details>
<summary>Show Plan :eyes:</summary>

```
...[maybe truncated]
ty_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-2425361638]
module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-4096861997]
module.vpc.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-006acfe6b999ba365]
module.vpc.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0e785b587a57d07e3]
module.vpc.module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-03032022c0fa2f537]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0415fae7313d3553d]
module.eks.module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=femsa-poc-cluster]
module.vpc.module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-07fd71421a00642dc1080289494]
module.vpc.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-094241eb90654a8961080289494]
module.eks.module.eks.time_sleep.this[0]: Refreshing state... [id=2024-12-03T20:01:59Z]
module.eks.module.eks.aws_ec2_tag.cluster_primary_security_group["account"]: Refreshing state... [id=sg-02f30072ad3796ca9,account]
module.eks.module.eks.data.aws_eks_addon_version.this["coredns"]: Reading...
module.eks.module.eks.aws_ec2_tag.cluster_primary_security_group["organization"]: Refreshing state... [id=sg-02f30072ad3796ca9,organization]
module.eks.module.eks.data.tls_certificate.this[0]: Reading...
module.eks.module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Reading...
module.eks.module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Reading...
module.eks.module.eks.data.tls_certificate.this[0]: Read complete after 0s [id=99d41e43229a4cdaf4141f3e8310e6d95c31dab9]
module.eks.module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"]: Reading...
module.nullplatform_configuration.nullplatform_provider_config.eks: Refreshing state... [id=7ec8435a-599a-4e77-a530-e71dcf9bd0b1]
module.eks_config.helm_release.eks_config_helm: Refreshing state... [id=nullplatform-base]
module.eks.module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::481665089566:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/B443DA30768DE46FDB07157320E7EB36]
module.eks.module.eks.module.eks_managed_node_group["default"].aws_launch_template.this[0]: Refreshing state... [id=lt-0a4a6e95b8ac55746]
module.aws_alb_controller.module.lb_role.data.aws_iam_policy_document.this[0]: Reading...
module.aws_alb_controller.module.lb_role.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=2432303708]
module.aws_alb_controller.module.lb_role.aws_iam_role.this[0]: Refreshing state... [id=femsa-poc-cluster_eks_lb]
module.eks.module.eks.data.aws_eks_addon_version.this["coredns"]: Read complete after 0s [id=coredns]
module.eks.module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 0s [id=kube-proxy]
module.eks.module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 0s [id=vpc-cni]
module.eks.module.eks.module.eks_managed_node_group["default"].aws_eks_node_group.this[0]: Refreshing state... [id=femsa-poc-cluster:default-20241203200205855300000017]
module.eks.module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"]: Read complete after 0s [id=aws-ebs-csi-driver]
module.aws_alb_controller.module.lb_role.aws_iam_role_policy_attachment.load_balancer_controller[0]: Refreshing state... [id=femsa-poc-cluster_eks_lb-20241203200131203500000014]
module.aws_alb_controller.kubernetes_service_account.service-account: Refreshing state... [id=kube-system/aws-load-balancer-controller]
module.eks.module.eks.aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=femsa-poc-cluster:kube-proxy]
module.eks.module.eks.aws_eks_addon.this["aws-ebs-csi-driver"]: Refreshing state... [id=femsa-poc-cluster:aws-ebs-csi-driver]
module.eks.module.eks.aws_eks_addon.this["vpc-cni"]: Refreshing state... [id=femsa-poc-cluster:vpc-cni]
module.eks.module.eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=femsa-poc-cluster:coredns]
module.eks.module.eks.kubernetes_config_map_v1_data.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
module.aws_alb_controller.helm_release.lb: Refreshing state... [id=aws-load-balancer-controller]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.alb.aws_lb.null-main-balancer will be created
  + resource "aws_lb" "null-main-balancer" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "null-main-balancer"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-00d1f27e753a8b24e",
          + "subnet-014d0e492af53b7f0",
        ]
      + tags_all                                                     = (known after apply)
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # module.alb.aws_lb.null-main-balancer-internal will be created
  + resource "aws_lb" "null-main-balancer-internal" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = true
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "null-main-balancer-internal"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-038cc901dec5c4243",
          + "subnet-05649d4e55557d4f4",
        ]
      + tags_all                                                     = (known after apply)
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # module.alb.aws_lb_listener.null-main-internal-listener-https will be created
  + resource "aws_lb_listener" "null-main-internal-listener-https" {
      + arn                      = (known after apply)
      + certificate_arn          = "arn:aws:acm:us-east-1:481665089566:certificate/1af7bc3f-d5e3-4cad-a0fa-85658abad27a"
      + id                       = (known after apply)
      + load_balancer_arn        = (known after apply)
      + port                     = 443
      + protocol                 = "HTTPS"
      + ssl_policy               = "ELBSecurityPolicy-TLS-1-2-2017-01"
      + tags_all                 = (known after apply)
      + tcp_idle_timeout_seconds = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # module.alb.aws_lb_listener.null-main-listener-http will be created
  + resource "aws_lb_listener" "null-main-listener-http" {
      + arn                      = (known after apply)
      + id                       = (known after apply)
      + load_balancer_arn        = (known after apply)
      + port                     = 80
      + protocol                 = "HTTP"
      + ssl_policy               = (known after apply)
      + tags_all                 = (known after apply)
      + tcp_idle_timeout_seconds = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # module.alb.aws_lb_listener.null-main-listener-https will be created
  + resource "aws_lb_listener" "null-main-listener-https" {
      + arn                      = (known after apply)
      + certificate_arn          = "arn:aws:acm:us-east-1:481665089566:certificate/1af7bc3f-d5e3-4cad-a0fa-85658abad27a"
      + id                       = (known after apply)
      + load_balancer_arn        = (known after apply)
      + port                     = 443
      + protocol                 = "HTTPS"
      + ssl_policy               = "ELBSecurityPolicy-TLS-1-2-2017-01"
      + tags_all                 = (known after apply)
      + tcp_idle_timeout_seconds = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # module.alb.aws_lb_target_group.default_target_group will be created
  + resource "aws_lb_target_group" "default_target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "default-tg"
      + name_prefix                        = (known after apply)
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "instance"
      + vpc_id                             = "vpc-05ae3f1f88bd81cd8"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.alb.aws_lb_target_group.default_target_group_internal will be created
  + resource "aws_lb_target_group" "default_target_group_internal" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "default-internal-tg"
      + name_prefix                        = (known after apply)
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "instance"
      + vpc_id                             = "vpc-05ae3f1f88bd81cd8"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.alb.aws_security_group.http-instance will be created
  + resource "aws_security_group" "http-instance" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "http-instance"
        }
      + tags_all               = {
          + "Name" = "http-instance"
        }
      + vpc_id                 = "vpc-05ae3f1f88bd81cd8"
    }

  # module.alb.aws_security_group.null-main-balancer will be created
  + resource "aws_security_group" "null-main-balancer" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "load_balancer"
        }
      + tags_all               = {
          + "Name" = "load_balancer"
        }
      + vpc_id                 = "vpc-05ae3f1f88bd81cd8"
    }

  # module.alb.aws_vpc_security_group_egress_rule.allow_instance_all will be created
  + resource "aws_vpc_security_group_egress_rule" "allow_instance_all" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + from_port              = -1
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = -1
    }

  # module.alb.aws_vpc_security_group_egress_rule.allow_lb_all will be created
  + resource "aws_vpc_security_group_egress_rule" "allow_lb_all" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + from_port              = -1
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = -1
    }

  # module.alb.aws_vpc_security_group_ingress_rule.allow_instance_http will be created
  + resource "aws_vpc_security_group_ingress_rule" "allow_instance_http" {
      + arn                          = (known after apply)
      + from_port                    = 80
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags_all                     = {}
      + to_port                      = 80
    }

  # module.alb.aws_vpc_security_group_ingress_rule.allow_instance_http_default_null will be created
  + resource "aws_vpc_security_group_ingress_rule" "allow_instance_http_default_null" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.82.124.0/22"
      + from_port              = 8080
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = 8080
    }

  # module.alb.aws_vpc_security_group_ingress_rule.allow_instance_ssh will be created
  + resource "aws_vpc_security_group_ingress_rule" "allow_instance_ssh" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.82.124.0/22"
      + from_port              = 22
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = 22
    }

  # module.alb.aws_vpc_security_group_ingress_rule.allow_lb_http will be created
  + resource "aws_vpc_security_group_ingress_rule" "allow_lb_http" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + from_port              = 80
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = 80
    }

  # module.alb.aws_vpc_security_group_ingress_rule.allow_lb_https will be created
  + resource "aws_vpc_security_group_ingress_rule" "allow_lb_https" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + from_port              = 443
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = 443
    }

  # module.iam_roles_policies.aws_iam_instance_profile.null-instance-profile will be created
  + resource "aws_iam_instance_profile" "null-instance-profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "null-instance-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "null-instance-role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.iam_roles_policies.aws_iam_policy.ecr-nullimages-read will be created
  + resource "aws_iam_policy" "ecr-nullimages-read" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "ecr-nullimages-read"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:DescribeImages",
                          + "ecr:DescribeRegistry",
                          + "ecr:DescribeRepositories",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:ListImages",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchGetImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.iam_roles_policies.aws_iam_policy.lambda-execution will be created
  + resource "aws_iam_policy" "lambda-execution" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "lambda-execution"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "lambda:InvokeFunction",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "ec2:AssignPrivateIpAddresses",
                          + "ec2:AttachNetworkInterface",
                          + "ec2:CreateNetworkInterface",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeTags",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeInstanceTypes",
                          + "ec2:DetachNetworkInterface",
                          + "ec2:ModifyNetworkInterfaceAttribute",
                          + "ec2:UnassignPrivateIpAddresses",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:CreateTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ec2:*:*:network-interface/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.iam_roles_policies.aws_iam_policy.null-aws-logs-enablement will be created
  + resource "aws_iam_policy" "null-aws-logs-enablement" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy to allow push cloudwatch logs"
      + id               = (known after apply)
      + name             = "null-aws-logs-enablement"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogStreams",
                          + "logs:PutRetentionPolicy",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:*:*:*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.iam_roles_policies.aws_iam_policy.null-params-read will be created
  + resource "aws_iam_policy" "null-params-read" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "null-params-read"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.iam_roles_policies.aws_iam_policy.nullplatform-assets-write will be created
  + resource "aws_iam_policy" "nullplatform-assets-write" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "nullplatform-assets-write"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.iam_roles_policies.aws_iam_policy.nullplatform_alb_manager_policy will be created
  + resource "aws_iam_policy" "nullplatform_alb_manager_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for managing ALB"
      + id               = (known after apply)
      + name             = "nullplatform-alb-manager-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "elasticloadbalancing:*"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeAccountAttributes",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeVpcClassicLink",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeClassicLinkInstances",
                          + "ec2:DescribeRouteTables",
                          + "ec2:DescribeCoipPools",
                          + "ec2:GetCoipPoolUsage",
                          + "ec2:DescribeVpcPeeringConnections",
                          + "cognito-idp:DescribeUserPoolClient",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = "iam:CreateServiceLinkedRole"
                      + Condition = {
                          + StringEquals = {
                              + "iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = "iam:CreateServiceLinkedRole"
                      + Condition = {
                          + StringEquals = {
                              + "iam:AWSServiceName" = "execute-api.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = "iam:CreateServiceLinkedRole"
                      + Condition = {
                          + StringEquals = {
                              + "iam:AWSServiceName" = "apigateway.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = "iam:CreateServiceLinkedRole"
                      + Condition = {
                          + StringEquals = {
                              + "iam:AWSServiceName" = "ops.apigateway.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = "arc-zonal-shift:*"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:elasticloadbalancing:*:*:loadbalancer/*"
                    },
                  + {
                      + Action   = [
                          + "arc-zonal-shift:ListManagedResources",
                          + "arc-zonal-shift:ListZonalShifts",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "account"      = "poc"
          + "organization" = "femsa"
        }
      + tags_all         = {
          + "account"      = "poc"
          + "organization" = "femsa"
        }
    }

  # module.iam_roles_policies.aws_iam_policy.nullplatform_asg_manager_policy will be created
  + resource "aws_iam_policy" "nullplatform_asg_manager_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for managing ASG"
      + id               = (known after apply)
      + name             = "nullplatform-asg-manager-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "autoscaling:*"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "cloudwatch:*",
                          + "logs:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = "iam:CreateServiceLinkedRole"
                      + Condition = {
                          + StringLike = {
                              + "iam:AWSServiceName" = "events.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:iam::*:role/aws-service-role/events.amazonaws.com/AWSServiceRoleForCloudWatchEvents*"
                    },
                  + {
                      + Action   = [
                          + "oam:ListAttachedLinks",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:oam:*:*:sink/*"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeAccountAttributes",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeImages",
                          + "ec2:DescribeInstanceAttribute",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeKeyPairs",
                          + "ec2:DescribeLaunchTemplateVersions",
                          + "ec2:DescribePlacementGroups",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeSpotInstanceRequests",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeVpcClassicLink",
                          + "ec2:RunInstances",
                          + "ec2:CreateTags",
                          + "ec2:CreateLaunchTemplate",
                          + "ec2:CreateLaunchTemplateVersion",
                          + "ec2:DeleteLaunchTemplate",
                          + "ec2:DeleteLaunchTemplateVersions",
                          + "ec2:DeleteTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeTargetGroups",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "iam:GetRole",
                          + "iam:PassRole",
                          + "iam:GetPolicy",
                          + "iam:GetPolicyVersion",
                          + "iam:GetRole",
                          + "oam:ListSinks",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = "iam:CreateServiceLinkedRole"
                      + Condition = {
                          + StringEquals = {
                              + "iam:AWSServiceName" = "autoscaling.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "account"      = "poc"
          + "organization" = "femsa"
        }
      + tags_all         = {
          + "account"      = "poc"
          + "organization" = "femsa"
        }
    }

  # module.iam_roles_policies.aws_iam_policy.nullplatform_lambda_manager_policy will be created
  + resource "aws_iam_policy" "nullplatform_lambda_manager_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for managing Lambda"
      + id               = (known after apply)
      + name             = "nullplatform-lambda-manager-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "account"      = "poc"
          + "organization" = "femsa"
        }
      + tags_all         = {
          + "account"      = "poc"
          + "organization" = "femsa"
        }
    }

  # module.iam_roles_policies.aws_iam_policy.nullplatform_params_manager_policy will be created
  + resource "aws_iam_policy" "nullplatform_params_manager_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for managing params"
      + id               = (known after apply)
      + name             = "nullplatform-params-manager-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "account"      = "poc"
          + "organization" = "femsa"
        }
      + tags_all         = {
          + "account"      = "poc"
          + "organization" = "femsa"
        }
    }

  # module.iam_roles_policies.aws_iam_policy_attachment.null-instance-lambda-execution-attach will be created
  + resource "aws_iam_policy_attachment" "null-instance-lambda-execution-attach" {
      + id         = (known after apply)
      + name       = "null-instance-role-lambda-execution"
      + policy_arn = (known after apply)
      + roles      = (known after apply)
    }

  # module.iam_roles_policies.aws_iam_policy_attachment.null-instance-role-aws-logs-enablement will be created
  + resource "aws_iam_policy_attachment" "null-instance-role-aws-logs-enablement" {
      + id         = (known after apply)
      + name       = "null-instance-role-s3-parameters-attach"
      + policy_arn = (known after apply)
      + roles      = (known after apply)
    }

  # module.iam_roles_policies.aws_iam_policy_attachment.null-instance-role-ecr-attach will be created
  + resource "aws_iam_policy_attachment" "null-instance-role-ecr-attach" {
      + id         = (known after apply)
      + name       = "null-instance-role-ecr-attach"
      + policy_arn = (known after apply)
      + roles      = (known after apply)
    }

  # module.iam_roles_policies.aws_iam_policy_attachment.null-instance-role-s3-parameters-read-attach will be created
  + resource "aws_iam_policy_attachment" "null-instance-role-s3-parameters-read-attach" {
      + id         = (known after apply)
      + name       = "null-instance-role-s3-parameters-read-attach"
      + policy_arn = (known after apply)
      + roles      = (known after apply)
    }

  # module.iam_roles_policies.aws_iam_role.null-instance-role will be created
  + resource "aws_iam_role" "null-instance-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "ec2.amazonaws.com",
                              + "lambda.amazonaws.com",
                            ]
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "null-instance-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam_roles_policies.aws_iam_role.nullplatform_scope_workflow_role will be updated in-place
  ~ resource "aws_iam_role" "nullplatform_scope_workflow_role" {
        id                    = "nullplatform-scope-workflow-role"
        name                  = "nullplatform-scope-workflow-role"
        tags                  = {
            "account"      = "poc"
            "organization" = "femsa"
        }
        # (12 unchanged attributes hidden)

      + inline_policy {
          + name   = "alb-manager-policy"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = "elasticloadbalancing:*"
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                      + {
                          + Action   = [
                              + "ec2:DescribeAccountAttributes",
                              + "ec2:DescribeAddresses",
                              + "ec2:DescribeInternetGateways",
                              + "ec2:DescribeSecurityGroups",
                              + "ec2:DescribeSubnets",
                              + "ec2:DescribeVpcs",
                              + "ec2:DescribeVpcClassicLink",
                              + "ec2:DescribeInstances",
                              + "ec2:DescribeNetworkInterfaces",
                              + "ec2:DescribeClassicLinkInstances",
                              + "ec2:DescribeRouteTables",
                              + "ec2:DescribeCoipPools",
                              + "ec2:GetCoipPoolUsage",
                              + "ec2:DescribeVpcPeeringConnections",
                              + "cognito-idp:DescribeUserPoolClient",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                      + {
                          + Action    = "iam:CreateServiceLinkedRole"
                          + Condition = {
                              + StringEquals = {
                                  + "iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"
                                }
                            }
                          + Effect    = "Allow"
                          + Resource  = "*"
                        },
                      + {
                          + Action    = "iam:CreateServiceLinkedRole"
                          + Condition = {
                              + StringEquals = {
                                  + "iam:AWSServiceName" = "execute-api.amazonaws.com"
                                }
                            }
                          + Effect    = "Allow"
                          + Resource  = "*"
                        },
                      + {
                          + Action    = "iam:CreateServiceLinkedRole"
                          + Condition = {
                              + StringEquals = {
                                  + "iam:AWSServiceName" = "apigateway.amazonaws.com"
                                }
                            }
                          + Effect    = "Allow"
                          + Resource  = "*"
                        },
                      + {
                          + Action    = "iam:CreateServiceLinkedRole"
                          + Condition = {
                              + StringEquals = {
                                  + "iam:AWSServiceName" = "ops.apigateway.amazonaws.com"
                                }
                            }
                          + Effect    = "Allow"
                          + Resource  = "*"
                        },
                      + {
                          + Action   = "arc-zonal-shift:*"
                          + Effect   = "Allow"
                          + Resource = "arn:aws:elasticloadbalancing:*:*:loadbalancer/*"
                        },
                      + {
                          + Action   = [
                              + "arc-zonal-shift:ListManagedResources",
                              + "arc-zonal-shift:ListZonalShifts",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
      + inline_policy {
          + name   = "asg-manager-policy"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = "autoscaling:*"
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                      + {
                          + Action   = [
                              + "cloudwatch:*",
                              + "logs:*",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                      + {
                          + Action    = "iam:CreateServiceLinkedRole"
                          + Condition = {
                              + StringLike = {
                                  + "iam:AWSServiceName" = "events.amazonaws.com"
                                }
                            }
                          + Effect    = "Allow"
                          + Resource  = "arn:aws:iam::*:role/aws-service-role/events.amazonaws.com/AWSServiceRoleForCloudWatchEvents*"
                        },
                      + {
                          + Action   = [
                              + "oam:ListAttachedLinks",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:oam:*:*:sink/*"
                        },
                      + {
                          + Action   = [
                              + "ec2:DescribeAccountAttributes",
                              + "ec2:DescribeAvailabilityZones",
                              + "ec2:DescribeImages",
                              + "ec2:DescribeInstanceAttribute",
                              + "ec2:DescribeInstances",
                              + "ec2:DescribeKeyPairs",
                              + "ec2:DescribeLaunchTemplateVersions",
                              + "ec2:DescribePlacementGroups",
                              + "ec2:DescribeSecurityGroups",
                              + "ec2:DescribeSpotInstanceRequests",
                              + "ec2:DescribeSubnets",
                              + "ec2:DescribeVpcClassicLink",
                              + "ec2:RunInstances",
                              + "ec2:CreateTags",
                              + "ec2:CreateLaunchTemplate",
                              + "ec2:CreateLaunchTemplateVersion",
                              + "ec2:DeleteLaunchTemplate",
                              + "ec2:DeleteLaunchTemplateVersions",
                              + "ec2:DeleteTags",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                      + {
                          + Action   = [
                              + "elasticloadbalancing:DescribeLoadBalancers",
                              + "elasticloadbalancing:DescribeTargetGroups",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                      + {
                          + Action   = [
                              + "iam:GetRole",
                              + "iam:PassRole",
                              + "iam:GetPolicy",
                              + "iam:GetPolicyVersion",
                              + "iam:GetRole",
                              + "oam:ListSinks",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                      + {
                          + Action    = "iam:CreateServiceLinkedRole"
                          + Condition = {
                              + StringEquals = {
                                  + "iam:AWSServiceName" = "autoscaling.amazonaws.com"
                                }
                            }
                          + Effect    = "Allow"
                          + Resource  = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
      + inline_policy {
          + name   = "lambda-manager-policy"
          + policy = (known after apply)
        }
      + inline_policy {
          + name   = "params-manager-policy"
          + policy = (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.iam_roles_policies.aws_iam_user_policy.nullplatform_build_workflow_user_policy_s3 will be created
  + resource "aws_iam_user_policy" "nullplatform_build_workflow_user_policy_s3" {
      + id          = (known after apply)
      + name        = "s3-write-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + user        = "nullplatform-build-workflow-user"
    }

  # module.nullplatform_configuration.nullplatform_provider_config.aws must be replaced
-/+ resource "nullplatform_provider_config" "aws" {
      - account    = "poc" -> null # forces replacement
      - dimensions = {} -> null
      ~ id         = "3bb7f40e-e07b-4d4f-afbd-ab645120cced" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.nullplatform_configuration.nullplatform_provider_config.ec2 will be created
  + resource "nullplatform_provider_config" "ec2" {
      + attributes = (known after apply)
      + id         = (known after apply)
      + nrn        = "organization=1304166607:account=996081796"
      + type       = "ec2-configuration"
    }

  # module.nullplatform_configuration.nullplatform_provider_config.ecr must be replaced
-/+ resource "nullplatform_provider_config" "ecr" {
      - account    = "poc" -> null # forces replacement
      - dimensions = {} -> null
      ~ id         = "5f19c668-a0b3-44af-9cf9-25e384975a0f" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.nullplatform_configuration.nullplatform_provider_config.eks must be replaced
-/+ resource "nullplatform_provider_config" "eks" {
      - account    = "poc" -> null # forces replacement
      ~ attributes = jsonencode(
          ~ {
              + web_pool_provider = "AWS:WEB_POOL:EKS"
                # (1 unchanged attribute hidden)
            }
        )
      - dimensions = {} -> null
      ~ id         = "7ec8435a-599a-4e77-a530-e71dcf9bd0b1" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.nullplatform_configuration.nullplatform_provider_config.lambda will be created
  + resource "nullplatform_provider_config" "lambda" {
      + attributes = (known after apply)
      + id         = (known after apply)
      + nrn        = "organization=1304166607:account=996081796"
      + type       = "aws-lambda-configuration"
    }

  # module.nullplatform_configuration.nullplatform_provider_config.network will be created
  + resource "nullplatform_provider_config" "network" {
      + attributes = (known after apply)
      + id         = (known after apply)
      + nrn        = "organization=1304166607:account=996081796"
      + type       = "aws-networking-configuration"
    }

  # module.nullplatform_configuration.nullplatform_provider_config.s3 will be created
  + resource "nullplatform_provider_config" "s3" {
      + attributes = (known after apply)
      + id         = (known after apply)
      + nrn        = "organization=1304166607:account=996081796"
      + type       = "s3-configuration"
    }

  # module.s3.aws_s3_bucket.assets-bucket will be created
  + resource "aws_s3_bucket" "assets-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "null-assets-femsa-poc-demo"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "account"      = "poc"
          + "organization" = "femsa"
        }
      + tags_all                    = {
          + "account"      = "poc"
          + "organization" = "femsa"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.s3.aws_s3_bucket.parameters-bucket will be created
  + resource "aws_s3_bucket" "parameters-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "null-parameters-femsa-poc-demo"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "account"      = "poc"
          + "organization" = "femsa"
        }
      + tags_all                    = {
          + "account"      = "poc"
          + "organization" = "femsa"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.s3.aws_secretsmanager_secret.nullservice_params_encryption will be created
  + resource "aws_secretsmanager_secret" "nullservice_params_encryption" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "nullservice/params_encryption"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # module.s3.aws_secretsmanager_secret_version.encryption_key will be created
  + resource "aws_secretsmanager_secret_version" "encryption_key" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # module.s3.random_uuid.encryption_key will be created
  + resource "random_uuid" "encryption_key" {
      + id     = (known after apply)
      + result = (known after apply)
    }

Plan: 44 to add, 1 to change, 3 to destroy.

Warning: Reference to undefined provider

  on main.tf line 56, in module "alb":
  56:     aws = aws

There is no explicit declaration for local provider name "aws" in module.alb,
so Terraform is assuming you mean to pass a configuration for
"hashicorp/aws".

If you also control the child module, add a required_providers entry named
"aws" with the source address "hashicorp/aws".

(and one more similar warning elsewhere)

Warning: Missing required argument

  with provider["registry.terraform.io/hashicorp/aws"],
  on providers.tf line 5, in provider "aws":
   5: provider "aws" {

The argument "role_arn" is required, but no definition was found.

This will be an error in a future release.

Warning: Argument is deprecated

  with module.iam_roles_policies.aws_iam_role.nullplatform_application_role,
  on modules/iam-roles-policies/main.tf line 119, in resource "aws_iam_role" "nullplatform_application_role":
 119: resource "aws_iam_role" "nullplatform_application_role" {

The inline_policy argument is deprecated. Use the aws_iam_role_policy
resource instead. If Terraform should exclusively manage all inline policy
associations (the current behavior of this argument), use the
aws_iam_role_policies_exclusive resource as well.

(and 5 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.


```
</details>

Actor: @osKar-vr
Git SHA: `ef2127ea8d02412df0d10391d81824b29174ec20`
<!-- Sticky Pull Request Commentterraform-execution -->